In [1]:
import pandas as pd
import mysql.connector
import sqlalchemy
from sqlalchemy import create_engine
import getpass

ModuleNotFoundError: No module named 'mysql'

In [3]:
host = "localhost"
user = "root"
password = getpass.getpass("Nhap mat khau:")
database = "DAY47W9"
try:
    connection = mysql.connector.connect(
        host = host ,
        user = user,
        password = password,
        database = database
    )

    if connection.is_connected():
        print("ket noi thanh cong ")
        cursor = connection.cursor()
except mysql.connector.Error as e:
    print(f"loi ")

ket noi thanh cong

In [5]:
cursor = connection.cursor()
cursor.execute("""CREATE DATABASE IF NOT EXISTS DAY47W9
                  DEFAULT CHARACTER SET utf8mb4
                  COLLATE utf8mb4_unicode_ci""")

In [4]:
engine = create_engine("mysql+mysqlconnector://root:qiwoqqwu@localhost/DAY47W9")

In [8]:
cursor = connection.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS categories (
        Category_ID INT AUTO_INCREMENT PRIMARY KEY,
        Category_Name VARCHAR(20)
    )
""")
cursor.execute("DESCRIBE categories")
for row in cursor.fetchall():
    print(row)

('Category_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('Category_Name', 'varchar(20)', 'YES', '', None, '')

In [12]:
cursor = connection.cursor()
cursor.execute("""
    INSERT INTO categories (Category_ID, Category_Name)
    VALUES 
        (1, 'Ao'),
        (2, 'Quan'),
        (3, 'Vay'),
        (4, 'Phu Kien')
""")
connection.commit()
df = pd.read_sql_query("SELECT * FROM categories", engine)

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'categories.PRIMARY'

In [13]:
print(df.tail())

   Category_ID Category_Name
0            1            Ao
1            2          Quan
2            3           Vay
3            4      Phu Kien

In [9]:
cursor = connection.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS products (
        Product_ID INT AUTO_INCREMENT PRIMARY KEY,
        Name VARCHAR(20),
        Category_ID INT ,
        Price DECIMAL(10,2),
        FOREIGN KEY (Category_ID) REFERENCES categories(Category_ID)
    )
""")
cursor.execute("DESCRIBE products")
for row in cursor.fetchall():
    print(row)

('Product_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('Name', 'varchar(20)', 'YES', '', None, '')
('Category_ID', 'int', 'YES', 'MUL', None, '')
('Price', 'decimal(10,2)', 'YES', '', None, '')

In [14]:
cursor = connection.cursor()
cursor.execute("""
                INSERT INTO products(Product_ID,Name,Category_ID,Price)
               VALUES   (101,'Ao So Mi Nam' , 1,300000),
                        (102,'Quan Jeans',2,500000),
                        (103,'Vay Xoe',3,450000) 
               """)
connection.commit()
df2 = pd.read_sql("SELECT * FROM products",engine)
print(df2.tail())

   Product_ID          Name  Category_ID     Price
0         101  Ao So Mi Nam            1  300000.0
1         102    Quan Jeans            2  500000.0
2         103       Vay Xoe            3  450000.0

In [11]:
cursor = connection.cursor()
cursor.execute("""
                CREATE TABLE IF NOT EXISTS Variants(
               Variant_id INT AUTO_INCREMENT PRIMARY KEY,
               Product_ID int ,
               color VARCHAR(15),
               Size VARCHAR(5),
               STOCK INT,
               FOREIGN KEY (Product_ID) REFERENCES products(Product_ID)  ) """)
cursor.execute("DESCRIBE Variants")
for row in cursor.fetchall():
    print(row)

('Variant_id', 'int', 'NO', 'PRI', None, 'auto_increment')
('Product_ID', 'int', 'YES', 'MUL', None, '')
('color', 'varchar(15)', 'YES', '', None, '')
('Size', 'varchar(5)', 'YES', '', None, '')
('STOCK', 'int', 'YES', '', None, '')

In [ ]:
cursor = connection.cursor()
cursor.execute("""INSERT INTO Variants (Variant_id,Product_ID,color,Size,STOCK) 
                    VALUES  (1,101,'trang','M',20),
                            (2,101,'trang','L',15),
                            (3,102,'xanh','M',10),
                            (4,103,'do','S',5)
                        """)
connection.commit()

IntegrityError: 1062 (23000): Duplicate entry '1' for key 'variants.PRIMARY'

In [19]:
df3 = pd.read_sql("SELECT * FROM Variants ",engine)
print(df3.tail())

   Variant_id  Product_ID  color Size  STOCK
0           1         101  trang    M     20
1           2         101  trang    L     15
2           3         102   xanh    M     10
3           4         103     do    S      5

In [14]:
cursor = connection.cursor()
cursor.execute("""
                CREATE TABLE IF NOT EXISTS Customer(
               Customer_ID INT AUTO_INCREMENT PRIMARY KEY ,
               NAME VARCHAR(20),
               PHONE VARCHAR(15),
               ADDRESS VARCHAR(50),
               CREATEDDATE DATE
               )""")
cursor.execute("DESCRIBE Customer")
for row in cursor.fetchall():
    print(row)

('Customer_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('NAME', 'varchar(20)', 'YES', '', None, '')
('PHONE', 'varchar(15)', 'YES', '', None, '')
('ADDRESS', 'varchar(50)', 'YES', '', None, '')
('CREATEDDATE', 'date', 'YES', '', None, '')

In [24]:
cursor = connection.cursor()
cursor.execute("""
    INSERT INTO Customer (Customer_ID, NAME, PHONE, ADDRESS, CREATEDDATE)
    VALUES 
        (1, 'Tran An', '0909123456', 'Ha Noi', '2024-01-10'),
        (2, 'Le Binh', '0909223456', 'TPHCM', '2024-02-05')
""")
connection.commit()

# Kiểm tra dữ liệu sau khi insert
df4 = pd.read_sql("SELECT * FROM Customer", engine)
print(df4)

   Customer_ID     NAME       PHONE ADDRESS CREATEDDATE
0            1  Tran An  0909123456  Ha Noi  2024-01-10
1            2  Le Binh  0909223456   TPHCM  2024-02-05

In [15]:
cursor = connection.cursor()
cursor.execute("DROP TABLE IF EXISTS Customer")

In [17]:
cursor = connection.cursor()
cursor.execute("""
                CREATE TABLE IF NOT EXISTS Customer(
               Customer_ID INT AUTO_INCREMENT PRIMARY KEY ,
               NAME VARCHAR(20),
               PHONE VARCHAR(15),
               ADDRESS VARCHAR(50),
               CREATEDDATE DATE
               )""")
cursor.execute("DESCRIBE Customer")
for row in cursor.fetchall():
    print(row)

('Customer_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('NAME', 'varchar(20)', 'YES', '', None, '')
('PHONE', 'varchar(15)', 'YES', '', None, '')
('ADDRESS', 'varchar(50)', 'YES', '', None, '')
('CREATEDDATE', 'date', 'YES', '', None, '')

In [19]:
cursor = connection.cursor()
cursor.execute("""
                CREATE TABLE IF NOT EXISTS ORDERS(
               ORDER_ID INT AUTO_INCREMENT PRIMARY KEY ,
               customer_id INT ,
               OrderDate date,
               status varchar(20),
                FOREIGN KEY (customer_id) REFERENCES customer(customer_id)           

               )""")
cursor.execute("DESCRIBE ORDERS")
for row in cursor.fetchall():
    print(row)

('ORDER_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('customer_id', 'int', 'YES', 'MUL', None, '')
('OrderDate', 'date', 'YES', '', None, '')
('status', 'varchar(20)', 'YES', '', None, '')

In [25]:
cursor=connection.cursor()
cursor.execute("""INSERT INTO ORDERS(ORDER_ID,customer_id,OrderDate,status)
               VALUES (1,1,'2024-03-01','Da Giao'),
                        (2,2,'2024-03-02','Da Dat')
               """)
connection.commit()
df5=pd.read_sql("Select * from ORDERS",engine)
df5.tail()

   ORDER_ID  customer_id   OrderDate   status
0         1            1  2024-03-01  Da Giao
1         2            2  2024-03-02   Da Dat

In [22]:
cursor = connection.cursor()
cursor.execute("""
    CREATE TABLE OrderDetails (
        Order_ID INT NOT NULL,
        Variant_ID INT NOT NULL,
        Quantity INT NOT NULL,
        Price DECIMAL(15, 2) NOT NULL,
        PRIMARY KEY (Order_ID, Variant_ID),
        FOREIGN KEY (Order_ID) REFERENCES Orders(Order_ID),
        FOREIGN KEY (Variant_ID) REFERENCES Variants(Variant_ID)
    );
""")
cursor.execute("DESCRIBE OrderDetails")  # Sửa đúng tên bảng ở đây
for row in cursor.fetchall():
    print(row)

('Order_ID', 'int', 'NO', 'PRI', None, '')
('Variant_ID', 'int', 'NO', 'PRI', None, '')
('Quantity', 'int', 'NO', '', None, '')
('Price', 'decimal(15,2)', 'NO', '', None, '')

In [26]:
cursor = connection.cursor()
cursor.execute("""INSERT INTO OrderDetails(Order_ID,Variant_ID,Quantity,Price)
               VALUES (1,1,2,300000),
               (1,3,1,500000),
               (2,4,1,450000)
               """)
connection.commit()
df6=pd.read_sql("SELECT * FROM OrderDetails",engine)
df6.tail()

   Order_ID  Variant_ID  Quantity     Price
0         1           1         2  300000.0
1         1           3         1  500000.0
2         2           4         1  450000.0

3.Liệt kê tất cả các đơn hàng, kèm theo tên khách hàng và tổng tiền của mỗi đơn hàng.

In [29]:
query3=("""SELECT O.Order_ID, O.Customer_ID, C.Name AS Customer_Name, SUM(OD.Price) AS Total
               FROM ORDERS as O 
               INNER JOIN OrderDetails as OD 
               on O.Order_ID = OD.Order_ID 
               INNER JOIN Customer as C
               on O.Customer_ID = C.Customer_ID
         GROUP BY O.Order_ID, O.Customer_ID, C.Name;""")
cau3 = pd.read_sql(query3,engine)
cau3.tail()

   Order_ID  Customer_ID Customer_Name     Total
0         1            1       Tran An  800000.0
1         2            2       Le Binh  450000.0

In [31]:
query3sub = ("""SELECT O.Order_ID, O.Customer_ID, C.Name AS Customer_Name, Sub.Total
                FROM 
                    (SELECT Order_ID, SUM(Price) AS Total
                    FROM OrderDetails
                    GROUP BY Order_ID) AS Sub
                INNER JOIN ORDERS AS O ON O.Order_ID = Sub.Order_ID
                INNER JOIN Customer AS C ON O.Customer_ID = C.Customer_ID;
""")
cau3sub = pd.read_sql(query3sub,engine)
cau3sub.tail()

   Order_ID  Customer_ID Customer_Name     Total
0         1            1       Tran An  800000.0
1         2            2       Le Binh  450000.0

4. Liệt kê các sản phẩm có tồn kho dưới 10.

In [52]:
query4join = ("""SELECT V.variant_ID,V.product_ID,sum(V.STOCK) as Stock
                FROM Variants as V
                INNER JOIN products as p 
                ON V.product_id = p.product_id
                LEFT JOIN OrderDetails as OD
                ON V.variant_ID = OD.Variant_ID
                GROUP BY V.Variant_ID, V.Product_ID, V.STOCK
                HAVING stock < 10
                 """)
cau4join = pd.read_sql(query4join,engine)
cau4join.tail()

   variant_ID  product_ID  Stock
0           4         103    5.0

In [45]:
query4joina = """
    SELECT V.Variant_ID, V.Product_ID, V.STOCK, P.Name
    FROM Variants AS V
    INNER JOIN Products AS P ON V.Product_ID = P.Product_ID
    WHERE V.STOCK < 10;
"""

cau4joina = pd.read_sql(query4joina, engine)
cau4joina.tail()

   Variant_ID  Product_ID  STOCK     Name
0           4         103      5  Vay Xoe

In [53]:
query4subquery_no_join = """
    SELECT V.variant_ID, V.product_ID, 
           (SELECT SUM(V1.STOCK) 
            FROM Variants V1 
            WHERE V1.variant_ID = V.variant_ID) AS Stock
    FROM Variants V
    WHERE EXISTS (SELECT 1 
                  FROM OrderDetails OD 
                  WHERE OD.Variant_ID = V.variant_ID)
    GROUP BY V.variant_ID, V.product_ID
    HAVING Stock < 10;
"""
cau4subquery_no_join = pd.read_sql(query4subquery_no_join, engine)
cau4subquery_no_join.tail()

   variant_ID  product_ID  Stock
0           4         103    5.0

Tính tổng doanh thu theo từng ngày đặt hàng
LEFT JOIN sẽ hợp lý hơn nếu bạn muốn tính doanh thu cho tất cả các đơn hàng (bao gồm cả đơn hàng không có sản phẩm).
INNER JOIN chỉ nên dùng nếu bạn chỉ muốn tính doanh thu cho các đơn hàng có sản phẩm trong OrderDetails.

In [60]:
query5join = """SELECT  SUM(OT.price*OT.Quantity)as REVENNUE,day(o.OrderDate) as day
                FROM orders as o 
                LEFT JOIN Orderdetails as OT 
                ON o.order_id  = OT.order_id
                group by day(o.OrderDate) 
                """
cau5join = pd.read_sql(query5join,engine)
cau5join.tail()

    REVENNUE  day
0  1100000.0    1
1   450000.0    2

Liệt kê các khách hàng đã từng có đơn hàng.

In [ ]:
query6join ="""SELECT DISTINCT c.customer_id, c.name
                FROM Customer c
                INNER JOIN Orders o ON c.customer_id = o.customer_id;
"""
cau6join = pd.read_sql(query6join,engine)
cau6join.tail()

   customer_id     name
0            1  Tran An
1            2  Le Binh

Liệt kê sản phẩm bán chạy nhất (theo tổng số lượng bán).

In [67]:
query7join ="""SELECT p.product_id, p.name, SUM(od.quantity) AS Total_Sold
                FROM orderdetails AS od
                JOIN variants AS v ON od.variant_id = v.variant_id
                JOIN products AS p ON v.product_id = p.product_id
                GROUP BY p.product_id, p.name
                ORDER BY Total_Sold DESC;

            """
cau7join=pd.read_sql(query7join,engine)
cau7join.tail()

   product_id          name  Total_Sold
0         101  Ao So Mi Nam         2.0
1         102    Quan Jeans         1.0
2         103       Vay Xoe         1.0

Tính tổng doanh thu theo từng loại danh mục sản phẩm.

In [71]:
query8join = """SELECT p.category_id, SUM(OD.price * OD.quantity) AS Total_Revenue
                FROM orderdetails AS OD
                JOIN variants AS V ON OD.variant_id = V.variant_id
                JOIN products AS p ON V.product_id = p.product_id
                GROUP BY p.category_id
                ORDER BY Total_Revenue DESC;
"""
cau8join = pd.read_sql(query8join,engine)
cau8join.tail()

   category_id  Total_Revenue
0            1       600000.0
1            2       500000.0
2            3       450000.0

Hiển thị chi tiết của một đơn hàng cụ thể (gồm tên sản phẩm, màu, size, số lượng, đơn
giá, tổng dòng).

In [7]:
query9join = """select p.name  as product_name,
                v.color as color, 
                v.size as size ,
                od.quantity as quantity,
                od.price  as Unit_price
                
                from orderdetails as od 
                join variants as v on od.variant_id = v.variant_id
                join products as p on v.product_id = p.product_id
                """

cau9join = pd.read_sql(query9join,engine)
cau9join.tail()

   product_name  color size  quantity  Unit_price
0  Ao So Mi Nam  trang    M         2    300000.0
1    Quan Jeans   xanh    M         1    500000.0
2       Vay Xoe     do    S         1    450000.0

Liệt kê các khách hàng chưa từng thực hiện đơn hàng nào

In [11]:
query10join ="""SELECT c.customer_id, c.name
                FROM customer c
                LEFT JOIN orders o ON c.customer_id = o.customer_id
                WHERE o.order_id IS NULL; """
cau10join=pd.read_sql(query10join,engine)
cau10join.tail()

Empty DataFrame
Columns: [customer_id, name]
Index: []